---
kind: property
id: P:Autodesk.Revit.DB.Lighting.AdvancedLossFactor.TemperatureLossFactor
source: html/ffd4d6b9-a4cb-b091-d77f-c480be8aeb44.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor.TemperatureLossFactor Property

The temperature loss factor.

## Syntax (C#)
```csharp
public double TemperatureLossFactor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The loss factor is not valid because it is not between 0.0 and 2.0.